This code shows how to handle missing values

In [1]:
#Import the dataset

import pandas as pd

df = pd.read_csv('data/ufo.csv')

In [2]:
df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [16]:
df.isna().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [8]:
missingrows = df.isna().sum()

In [10]:
print(df.columns)
print(missingrows.shape)
print(df.shape)

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')
(5,)
(18241, 5)

In [15]:
#Percentange of missing values 
for column in df.columns:
    print('Percentage of missing values in {} is {}'.format(column,missingrows[column]/len(df)))

Percentage of missing values in City is 0.0013705388958938655
Percentage of missing values in Colors Reported is 0.8420042760813552
Percentage of missing values in Shape Reported is 0.1449481936297352
Percentage of missing values in State is 0.0
Percentage of missing values in Time is 0.0

In [6]:
df.describe()

           City Colors Reported Shape Reported  State              Time
count     18216            2882          15597  18241             18241
unique     6476              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [7]:
df.shape

(18241, 5)

In [17]:
#drop columns that have 80% or more missing values
data = df.dropna(axis=1, thresh=3648)

In [18]:
data.describe()

           City Shape Reported  State              Time
count     18216          15597  18241             18241
unique     6476             27     52             16145
top     Seattle          LIGHT     CA  11/16/1999 19:00
freq        187           2803   2529                27

In [13]:
data['Shape Reported'].value_counts()

LIGHT        2803
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
ROUND           2
CRESCENT        2
FLARE           1
DOME            1
HEXAGON         1
PYRAMID         1
Name: Shape Reported, dtype: int64

In [19]:
data.fillna({
                 'Shape Reported':'UNKNOWN',
            },
        inplace = True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:6245: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [20]:
data.describe()

           City Shape Reported  State              Time
count     18216          18241  18241             18241
unique     6476             28     52             16145
top     Seattle          LIGHT     CA  11/16/1999 19:00
freq        187           2803   2529                27

In [21]:
data['Shape Reported'].value_counts()

LIGHT        2803
UNKNOWN      2644
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
HEXAGON         1
FLARE           1
PYRAMID         1
DOME            1
Name: Shape Reported, dtype: int64

In [22]:
data = data.dropna()

In [23]:
data.describe()

           City Shape Reported  State              Time
count     18216          18216  18216             18216
unique     6476             28     52             16126
top     Seattle          LIGHT     CA  11/16/1999 19:00
freq        187           2801   2525                27